[
  {
    "url": "https://udlguidelines.cast.org/engagement/",
    "title": "Search",
    "content": "Engagement\nAffect represents a crucial element to the learning process, and learners differ markedly in what sparks their motivation and enthusiasm for learning. Learners must be able to bring their authentic selves to the learning environment and find connections to what matters most in their lives. The UDL framework emphasizes the idea of learner variability, and learners’ multiple and intersecting identities are an essential layer of fully recognizing the notion of learner variability. While we emphasize dimensions of identity as a part of variability in this section on Multiple Means of Engagement, the essential role identity plays in learning is woven across all three UDL principles. Further, learners' interests and sources of motivation may vary depending on the context. Some learners may be highly engaged by spontaneity and novelty while others are disengaged, even frightened, by those aspects, preferring strict routine. Some learners might like to work alone, while others prefer to work with their peers. And, these preferences might vary from week to week or even day to day. In reality, there is not one means of engagement that will be optimal for all learners in all contexts; multiple options for engagement are essential.\nEngagement | Guidelines & Considerations\nGuideline 7Welcoming Interests & Identities\nHonor learners’ whole selves.\nConsideration 7.1Optimize choice and autonomy\nDevelop agency in the learning process.\nConsideration 7.2Optimize relevance, value, and authenticity\nConnect learning to experiences that are meaningful and valuable.\nConsideration 7.3Nurture joy and play\nSpark joy and playfulness in the learning process.\nConsideration 7.4Address biases, threats, and distractions\nFoster spaces to learn and take risks.\nGuideline 8Sustaining Effort & Persistence\nTackle challenges with focus and determination.\nConsideration 8.1Clarify the meaning and purpose of goals\nEmphasize the goal and why it matters.\nConsideration 8.2Optimize challenge and support\nSet high expectations using flexible tools and supports.\nConsideration 8.3Foster collaboration, interdependence, and collective learning\nLearn from and with one another.\nConsideration 8.4Foster belonging and community\nCultivate spaces where learners are wanted and where learners want to be.\nConsideration 8.5Offer action-oriented feedback\nGuide learning by emphasizing the role of effort and process.\nGuideline 9Emotional Capacity\nHarness the power of emotions and motivation in learning.\nConsideration 9.1Recognize expectations, beliefs, and motivations\nSet goals that inspire confidence and ownership of learning.\nConsideration 9.2Develop awareness of self and others\nDevelop and manage healthy emotional responses and interactions.\nConsideration 9.3Promote individual and collective reflection\nIncrease awareness around progress toward goals and how to learn from mistakes.\nConsideration 9.4Cultivate empathy and restorative practices\nLearn from others’ perspectives and repair harm.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "guideline_number": "7",
    "guideline_name": "Welcoming Interests & Identities",
    "sub_guideline": "Welcoming Interests & Identities"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/",
    "title": "Search",
    "content": "Representation\nLearners differ in the ways they perceive and make meaning of information.For example, those with sensory disabilities (e.g., blindness or deafness), learning disabilities (e.g., dyslexia), and those representing diverse or non-dominant cultures and/or languages all approach content differently. And these differing approaches must be honored and valued. Equally important is the consideration of how people, cultures, individual and collective identities, perspectives, and ways of knowing are represented within the content. Learning, and transfer of learning, occurs when multiple representations and perspectives are used, because they support learners to make connections within, as well as between, concepts. In short,there is not one means of representation that will be optimal for every learner; providing options for representation is essential.\nRepresentation | Guidelines & Considerations\nGuideline 1Perception\nInteract with flexible content that offers multiple modalities and perspectives.\nConsideration 1.1Support opportunities to customize the display of information\nUse accessible materials with settings that can be adjusted based on needs and preferences.\nConsideration 1.2Support multiple ways to perceive information\nShare information in more ways than images and text alone.\nConsideration 1.3Represent a diversity of perspectives and identities in authentic ways\nLearn from multiple and varying perspectives.\nGuideline 2Language & Symbols\nCommunicate through languages that create a shared understanding.\nConsideration 2.1Clarify vocabulary, symbols, and language structures\nConstruct meaning from words, symbols, and numbers using different representations.\nConsideration 2.2Support decoding of text, mathematical notation, and symbols\nMake sure text and symbols don't get in the way of the learning goal.\nConsideration 2.3Cultivate understanding and respect across languages and dialects\nUse translations, descriptions, movement, and images to support learning in unfamiliar or complex languages.\nConsideration 2.4Address biases in the use of language and symbols\nHonor a wide variety of forms of language.\nConsideration 2.5Illustrate through multiple media\nMake learning come alive with simulations, graphics, activities, and videos.\nGuideline 3Building Knowledge\nConstruct meaning and generate new understandings.\nConsideration 3.1Connect prior knowledge to new learning\nBuild connections to prior understandings and experiences.\nConsideration 3.2Highlight and explore patterns, critical features, big ideas, and relationships\nAccentuate important information and how it relates to the learning goal.\nConsideration 3.3Cultivate multiple ways of knowing and making meaning\nHonor multiple and diverse ways of developing understandings of the world.\nConsideration 3.4Maximize transfer and generalization\nApply learning to new contexts.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "guideline_number": "1",
    "guideline_name": "Perception",
    "sub_guideline": "Perception"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/",
    "title": "Search",
    "content": "Action & Expression\nLearners differ in the ways they navigate a learning environment, approach the learning process, and express what they know. Therefore, it is essential to design for and honor these varying forms of action and expression.For example, all individuals, including those with disabilities, approach learning tasks very differently. Depending on the context, some may prefer to express themselves in written text but not speech, and vice versa. It should also be recognized that action and expression require a great deal of strategy, practice, and organization, and this is another area in which learners will differ. In reality,there is not one means of action and expression that will be optimal for every learner; options for action and expression are essential.\nAction & Expression | Guidelines & Considerations\nGuideline 4Interaction\nInteract with accessible materials and tools.\nConsideration 4.1Vary and honor the methods for response, navigation, and movement\nInteract with tools and environments that make learning physically accessible.\nConsideration 4.2Optimize access to accessible materials and assistive and accessible technologies and tools\nOpen doors to learning with accessible tools and devices.\nGuideline 5Expression & Communication\nCompose and share ideas using tools that help attain learning goals.\nConsideration 5.1Use multiple media for communication\nExpress learning in flexible ways.\nConsideration 5.2Use multiple tools for construction, composition, and creativity\nShare thoughts and ideas using tools that complement the learning goal.\nConsideration 5.3Build fluencies with graduated support for practice and performance\nApply and gradually release scaffolds to support learner agency.\nConsideration 5.4Address biases related to modes of expression and communication\nHonor a wide variety of forms of communication.\nGuideline 6Strategy Development\nStrategize  and act on plans to make the most out of learning.\nConsideration 6.1Set meaningful goals\nPractice setting challenging and authentic goals.\nConsideration 6.2Anticipate and plan for challenges\nFormulate reasonable plans for reaching goals.\nConsideration 6.3Organize information and resources\nSupport organization and memory using flexible tools and processes.\nConsideration 6.4Enhance capacity for monitoring progress\nAnalyze growth over time and how to build from it.\nConsideration 6.5Challenge exclusionary practices\nWork toward building more inclusive spaces and systems.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "guideline_number": "4",
    "guideline_name": "Interaction",
    "sub_guideline": "Interaction"
  },
  {
    "url": "https://udlguidelines.cast.org/",
    "title": "Search",
    "content": "The CAST UDL Guidelines™ are a tool that can be applied in any discipline or domain to ensure that all learners are able to access and participate in meaningful, challenging learning opportunities.The Guidelines are a set of concrete suggestions rooted in the principles ofUniversal Design for Learning (UDL)external site, an educational framework developed byCASTexternal site.\nUDL is based on scientific insights into how humans learn, and issupported by evidenceexternal siteto benefit learners of all ages and across learning contexts.The goal of UDLis learner agency that is purposeful & reflective, resourceful & authentic, strategic & action-oriented.\nThe UDL Guidelines can support educators, curriculum developers, learning and instructional designers, researchers, parents, and more to apply the UDL framework to practice.\nFor more guidance on Universal Design for Learning and how to use the UDL Guidelines in practice, find additional resources in theCAST Professional Publishing catalogexternal site, or explore ouronline coursesexternal siteand professional development opportunities forPreK-12external site,Postsecondaryexternal site, andWorkforce and CTEexternal site.\nIntroducing CAST UDL Guidelines 3.0\nThe UDL Guidelines are a living, dynamic tool that is continuously developed based on new research and feedback from practitioners. After launching our most recent effort to update the UDL Guidelines in 2020, on July 30th, 2024 we are thrilled to releaseUDL Guidelines 3.0!\nThis new iteration of the UDL Guidelines responds to a strong call from the field—both practitioners and researchers alike—to address critical barriers rooted in biases and systems of exclusion for learners with and without disabilities.\nExplore the Future of Education with CAST’s UDL Guidelines 3.0 Webinars!\nView our series of free, dynamic webinars designed to empower educators, administrators, and leaders with the latest insights and practical strategies from the UDL Guidelines 3.0.\nView Webinars\nLearn more about the goal of UDL, learner agency.\nHow to use and interpret the UDL Guidelines Graphic Organizer website.\nLearn more about the development of Guidelines 3.0 and the updating process.\nSave and print the Guidelines Graphic Organizer including translated and past versions.\nLearn more about the research evidence used to develop the Guidelines.\nBrief answers to frequently asked questions about the UDL Guidelines.\nUniversal Design for Learning Guidelines\nThe goal of UDL islearner agencythat is purposeful & reflective, resourceful & authentic, strategic & action-oriented.\nDesign Multiple Means ofEngagement\nDesign Options forWelcoming Interests & Identities(guideline7)\nDesign Options forSustaining Effort & Persistence(guideline8)\nDesign Options forEmotional Capacity(guideline9)\nDesign Multiple Means ofRepresentation\nDesign Options forPerception(guideline1)\nDesign Options forLanguage & Symbols(guideline2)\nDesign Options forBuilding Knowledge(guideline3)\nDesign Multiple Means ofAction & Expression\nDesign Options forInteraction(guideline4)\nDesign Options forExpression & Communication(guideline5)\nDesign Options forStrategy Development(guideline6)\nPDF versions of the graphic organizer are available on the downloads page.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Welcoming Interests & Identities"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/interests-identities/",
    "title": "Search",
    "content": "Engagement\nWelcoming Interests & Identities\nTo spark engagement in the learning process, learners’ unique interests as well as their unique identities, including intersecting dimensions such as race/ethnicity, culture, gender, language, and disability, must be recognized, sustained, and valued. It is essential to acknowledge the remarkable variability in what attracts and engages learners’ interests and what constitutes an environment that affirms the dignity of every learner. Even the same learner will differ over time and circumstance. Their interests change as they develop and gain new knowledge and skills, and their connections to different dimensions of their identities may change as well. Creating a learning environment that welcomes learners’ whole selves is a critical step to ensuring learners are able to access and engage with the learning process.\nWelcoming Interests & Identities | Considerations\nConsideration 7.1Optimize choice and autonomy\nDevelop agency in the learning process.\nConsideration 7.2Optimize relevance, value, and authenticity\nConnect learning to experiences that are meaningful and valuable.\nConsideration 7.3Nurture joy and play\nSpark joy and playfulness in the learning process.\nConsideration 7.4Address biases, threats, and distractions\nFoster spaces to learn and take risks.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "guideline_number": "7.1",
    "guideline_name": "Optimize choice and autonomy",
    "sub_guideline": "Welcoming Interests & Identities"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/interests-identities/choice-autonomy/",
    "title": "Search",
    "content": "Engagement\nWelcoming Interests & Identities\nOptimize choice and autonomy\nEmbedding authentic choices that align with learning goals can be a meaningful way to enhance learner engagement. Depending upon the learning goal, choices can be offered in how the goal can be pursued, such as the context for achieving the goal or the tools or supports available. Offering learners choices can develop agency, pride in accomplishment, and increase connection to their learning. However, it is important to note that individuals differ in how much and what kind of choices they prefer to have. It is therefore not enough to simply provide choice. Options for choice and autonomy must be optimized to ensure engagement.\nEmbed choices that align with the learning goal, such as:The content to exploreThe tools used for exploration or productionThe type of rewards or recognition availableThe opportunities for practicing and assessing learningThe design or graphics of layouts, etc.The sequence or timing for completion of tasks\nEmbed choices that align with the learning goal, such as:\nThe content to explore\nThe tools used for exploration or production\nThe type of rewards or recognition available\nThe opportunities for practicing and assessing learning\nThe design or graphics of layouts, etc.\nThe sequence or timing for completion of tasks\nUse a collaborative approach among learners and educators to co-design learning goals, activities, and tasks.\nUse a collaborative approach among learners and educators to co-design learning goals, activities, and tasks.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Welcoming Interests & Identities",
    "guideline_number": "7.1",
    "guideline_name": "Optimize choice and autonomy"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/interests-identities/relevance-value-authenticity/",
    "title": "Search",
    "content": "Engagement\nWelcoming Interests & Identities\nOptimize relevance, value, and authenticity\nIndividuals are engaged by content and activities that are relevant and valuable to their interests, goals, and communities. This does not necessarily mean the situation has to be equivalent to real life, as fiction can be just as engaging to learners as non-fiction. It does, however, have to be relevant and authentic to learners’ individual and/or community goals and the instructional goals. Individuals are rarely interested in information and activities that have no relevance or value. In an educational setting, one of the most important ways educators recruit interest is to highlight the utility and relevance of learning and to demonstrate relevance through authentic, meaningful activities. It is a mistake, of course, to assume all learners will find the same activities or information equally relevant or valuable to their goals. To recruit all learners equally, it is critical to provide options that optimize what is relevant, valuable, and meaningful to the learner.\nVary activities and sources of information so they can be:Personalized and contextualized to learners’ livesCulturally relevant and sustainingSocially relevantAge and ability appropriateAppropriate for different racial, cultural, ethnic, and gender groups\nVary activities and sources of information so they can be:\nPersonalized and contextualized to learners’ lives\nCulturally relevant and sustaining\nSocially relevant\nAge and ability appropriate\nAppropriate for different racial, cultural, ethnic, and gender groups\nDesign activities so learning outcomes are authentic, communicate to real audiences, and reflect a purpose that is clear to the participants.\nDesign activities so learning outcomes are authentic, communicate to real audiences, and reflect a purpose that is clear to the participants.\nProvide tasks that allow for active participation, exploration, and experimentation.\nProvide tasks that allow for active participation, exploration, and experimentation.\nInvite personal response, evaluation, and self-reflection to content and activities.\nInvite personal response, evaluation, and self-reflection to content and activities.\nInclude activities that foster the use of imagination to solve novel and relevant problems, or make sense of complex ideas in creative ways.\nInclude activities that foster the use of imagination to solve novel and relevant problems, or make sense of complex ideas in creative ways.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Welcoming Interests & Identities",
    "guideline_number": "7.2",
    "guideline_name": "Optimize relevance, value, and authenticity"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/interests-identities/joy-play/",
    "title": "Search",
    "content": "Engagement\nWelcoming Interests & Identities\nNurture joy and play\nLearning environments that spark joy and nurture opportunities for play are central to the learning process. Play supports the learning and development of learners of all ages — from young children to adults. Engaging in play can spark curiosity, wonder, and imagination as learners construct new understandings and develop relationships. These acts of playfulness can lead learners to experience a sense of joy that adds to the engagement in the learning process, from early childhood through adulthood. Further, for historically marginalized learners, finding a sense of joy can serve as an act of resistance to oppressive systems. For example, the notion of Black Joy centers ideas of freedom, imagination, community, and love. Yet, not all learners experience joy and play in the same ways, and even the same learner isn’t going to find joy in the same way every time. A UDL lens reminds us of the variability of every learner and the importance of embedding options and flexibility into the learning environment to support learners to find their own joy.\nNurture playfulness in a variety of forms including, but not limited to, outdoor play, sensory play, imaginative play, and play through the arts.\nIncorporate opportunities for exploration, experimentation, and discovery.\nCreate space for learners to find joy through connections to their identities, sense of self, and communities.\nCreate space for learners to take pride in their accomplishments.\nIncorporate storytelling.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Welcoming Interests & Identities",
    "guideline_number": "7.3",
    "guideline_name": "Nurture joy and play"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/interests-identities/biases-threats-distractions/",
    "title": "Search",
    "content": "Engagement\nWelcoming Interests & Identities\nAddress biases, threats, and distractions\nOne of the most important things an educator can do is to create an accepting and supportive space for learners, in which they feel valued, supported, agentic, and encouraged to take risks, form their own opinions, and engage in dialogue. To do this, educators need to address potential biases, threats, and distractions in the learning environment, both overt and subtle. When learners have to focus their attention on having basic needs met or avoiding a negative or oppressive experience, they cannot engage with the learning process. While the physical safety of a learning environment is of course necessary, subtler types of threats and distractions must be attended to as well. What is threatening or potentially distracting depends on learners’ individual needs and backgrounds. The optimal instructional environment offers options that reduce threats and negative distractions to create a space in which learning can occur.\nCreate an accepting and supportive learning culture by:Exploring how educator and learner biases can impact the learning environmentCreating space and ways for learners to share the biases, threats, and distractions they may be experiencingNurturing a culture where mistakes are a part of the learning process\nCreate an accepting and supportive learning culture by:\nExploring how educator and learner biases can impact the learning environment\nCreating space and ways for learners to share the biases, threats, and distractions they may be experiencing\nNurturing a culture where mistakes are a part of the learning process\nVary the level of novelty or risk through:Charts, calendars, schedules, visible timers, cues, etc., that can increase the predictability of daily activities and transitionsCreation of class routinesAlerts and previews that can help learners anticipate and prepare for changes in activities, schedules, and novel eventsOptions that can, in contrast to the above, maximize the unexpected, surprising, or novel in highly routinized activities\nVary the level of novelty or risk through:\nCharts, calendars, schedules, visible timers, cues, etc., that can increase the predictability of daily activities and transitions\nCreation of class routines\nAlerts and previews that can help learners anticipate and prepare for changes in activities, schedules, and novel events\nOptions that can, in contrast to the above, maximize the unexpected, surprising, or novel in highly routinized activities\nVary the level of sensory stimulation through:Variation in the presence of background noise or visual stimulation, noise buffers, number of features or items presented at a timeVariation in pace of work, length of work sessions, availability of breaks or time-outs, or timing or sequence of activities\nVary the level of sensory stimulation through:\nVariation in the presence of background noise or visual stimulation, noise buffers, number of features or items presented at a time\nVariation in pace of work, length of work sessions, availability of breaks or time-outs, or timing or sequence of activities\nVary the social demands required for learning or performance, the perceived level of support and protection, and the requirements for public display and evaluation.\nVary the social demands required for learning or performance, the perceived level of support and protection, and the requirements for public display and evaluation.\nAcknowledge negative experiences within learning environments and take steps such as shared agreements or self regulation options to make learners comfortable.\nAcknowledge negative experiences within learning environments and take steps such as shared agreements or self regulation options to make learners comfortable.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Welcoming Interests & Identities",
    "guideline_number": "7.4",
    "guideline_name": "Address biases, threats, and distractions"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/effort-persistence/",
    "title": "Search",
    "content": "Engagement\nSustaining Effort & Persistence\nLearning is an ongoing process that oftentimes requires sustained effort and determination. Learners are highly variable in terms of the ways they are inspired to persist through challenging aspects of the learning process, and this variability can shift depending on the learning context. To sustain effort and persistence, effective learning designs consider options for creating goals that are meaningful and purposeful, offering scaffolds and supports in service of challenging goals, fostering collaboration and belonging, and offering on-going, action-oriented feedback. These external designs in the environment can support individual learners and communities of learners to connect with the learning process and feel inspired to work toward learning goals.\nSustaining Effort & Persistence | Considerations\nConsideration 8.1Clarify the meaning and purpose of goals\nEmphasize the goal and why it matters.\nConsideration 8.2Optimize challenge and support\nSet high expectations using flexible tools and supports.\nConsideration 8.3Foster collaboration, interdependence, and collective learning\nLearn from and with one another.\nConsideration 8.4Foster belonging and community\nCultivate spaces where learners are wanted and where learners want to be.\nConsideration 8.5Offer action-oriented feedback\nGuide learning by emphasizing the role of effort and process.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "guideline_number": "8.1",
    "guideline_name": "Clarify the meaning and purpose of goals",
    "sub_guideline": "Sustaining Effort & Persistence"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/effort-persistence/meaning-purpose-goals/",
    "title": "Search",
    "content": "Engagement\nSustaining Effort & Persistence\nClarify the meaning and purpose of goals\nOver the course of any sustained project or practice, there are many sources of interest and engagement that compete for attention and effort. To support sustained effort and persistence, it is essential for learners to be clear on the goal and to have space to explore how the goal is meaningful to their own lives and communities. Further, it is important the meaning and purpose of the goal is clearly and consistently reinforced and apparent to learners throughout the learning process.\nExplicitly formulate or restate the goal.\nDisplay the goal in multiple ways.\nEncourage organization of long-term goals into short-term objectives.\nUse prompts or scaffolds for imagining desired outcomes.\nCo-construct ideals of excellence and generate relevant examples that connect to learners’ cultural backgrounds, identities, and interests.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Sustaining Effort & Persistence",
    "guideline_number": "8.1",
    "guideline_name": "Clarify the meaning and purpose of goals"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/effort-persistence/challenge-support/",
    "title": "Search",
    "content": "Engagement\nSustaining Effort & Persistence\nOptimize challenge and support\nThe UDL framework is grounded in a belief in the brilliance of every learner and the importance of setting high expectations. The design of the learning environment must not only support access, but support participation and progress toward challenging learning goals as well. All learners need to be challenged, but not always in the same way. It is important for the learning environment to embed a variety of tools, resources, and supports to promote successful engagement with the learning goal and to ensure learners find challenges that are optimally motivating. Balancing the resources available to meet the challenge is vital, as productive struggle is a key component of an engaging and rigorous learning experience.\nPresume competence and nurture a belief in the capabilities of every learner.\nOffer options with varying modes of complexity or difficulty.\nOffer options for tools and scaffolds that align with the learning goal and promote agency.\nEmphasize process, effort, and progress in meeting standards as alternatives to external evaluation and competition.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Sustaining Effort & Persistence",
    "guideline_number": "8.2",
    "guideline_name": "Optimize challenge and support"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/effort-persistence/collaboration/",
    "title": "Search",
    "content": "Engagement\nSustaining Effort & Persistence\nFoster collaboration, interdependence, and collective learning\nCollectively generating knowledge and learning from one another’s diversity of ideas, perspectives, and lived experiences is central to the learning process. Creating communities, teams, and partnerships that can push and extend each other’s thinking and practice care for one another is a powerful way to sustain effort and persistence, and to support learners to thrive more broadly. Connected to these notions of collaboration and collective learning is the idea of interdependence — a reminder that we are all interconnected, our decisions and actions impact others, and learners can support one another. The disability community reminds us of the value of interdependence as opposed to an overemphasis on independence. We can work to support each other to ensure needs are met within the learning environment, and more broadly.\nCreate community agreements that emphasize learners’ ideas for fostering collaboration, interdependence, and collective learning.\nCreate teams with clear goals, roles, expectations, and responsibilities.\nUse prompts that guide learners in when and how to ask for help.\nUse prompts or protocols that guide learners to surface and share differing perspectives.\nEncourage and support opportunities for peer interactions and supports (e.g., peer tutors).\nConstruct communities of learners engaged in common interests or activities or who identify in similar ways.\nConstruct communities of learners engaged in differing interests or activities or who identify in differing ways.\nEncourage questions to more fully understand concepts, ideas, and perspectives.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Sustaining Effort & Persistence",
    "guideline_number": "8.3",
    "guideline_name": "Foster collaboration, interdependence, and collective learning"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/effort-persistence/belonging-community/",
    "title": "Search",
    "content": "Engagement\nSustaining Effort & Persistence\nFoster belonging and community\nTo support learners to sustain effort and persistence — and to thrive as learners more broadly — it is critical to design learning environments where learners feel a legitimate sense of belonging and community. Fostering this legitimate sense of belonging and community is especially important for learners who have been historically excluded and/or marginalized. Further, it is important to remember the sources and meanings of belonging and community will vary across learners and contexts. Designing learning environments where there are multiple ways to develop relationships, practice caring for one another, and strengthen connections to learners' multiple and intersecting identities is essential.\nCreate opportunities for learners to share their perspectives on what belonging and community can feel like and look like.\nCreate opportunities for learners to share their ideas for different ways to foster belonging and community.\nWelcome interests and identities. (Guideline 7)\nExamine when or how bias may be creating barriers to learners’ sense of belonging.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "guideline_number": "8.4",
    "guideline_name": "Foster belonging and community",
    "sub_guideline": "Sustaining Effort & Persistence"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/effort-persistence/feedback/",
    "title": "Search",
    "content": "Engagement\nSustaining Effort & Persistence\nOffer action-oriented feedback\nAssessment is most productive for sustaining engagement when the feedback is relevant, constructive, accessible, consequential, and timely. But the type of feedback is also critical in helping learners to sustain the motivation and effort essential to learning. Action-oriented feedback is the type of feedback that offers specific comments on ways to make progress and take action toward the learning goal. This type of feedback emphasizes the role of effort and practice rather than “intelligence” or inherent “ability” as an important factor in guiding learners toward successful long-term habits of mind and learning practices.\nOffer feedback that encourages perseverance, focuses on development of efficacy and self-awareness, and encourages the use of specific supports and strategies in the face of challenge.\nOffer feedback that emphasizes effort, improvement, and achieving a goal rather than on relative performance.\nOffer feedback that is frequent, timely, and specific.\nOffer feedback that is substantive and informative rather than comparative or competitive.\nOffer feedback that models how to incorporate reflection, including identifying patterns of challenges or strengths, into positive strategies for future success.\nOffer feedback that encourages risk taking and offers another (or differing) perspective(s).",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Sustaining Effort & Persistence",
    "guideline_number": "8.5",
    "guideline_name": "Offer action-oriented feedback"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/emotional-capacity/",
    "title": "Search",
    "content": "Engagement\nEmotional Capacity\nA critical aspect of human development is attending to one’s abilities to recognize emotions, manage thoughts and behaviors, and empathize with others. An emotional response does not preclude rational thinking; emotions are part of the human experience. Effective learning environments develop learners’ intrinsic abilities to regulate their own emotions and choose how to move forward in service of their learning. While many individuals develop regulatory skills and practices on their own, either by trial and error or by observing successful adults, many others can benefit from more explicit supports.\nUnfortunately, some learning environments do not address these skills and practices explicitly, leaving them as part of the “implicit” curriculum that is often inaccessible to many. Those educators and settings that develop emotional capacity explicitly will be most successful in applying the UDL principles through modeling and prompting in a variety of methods. As in other kinds of learning, individual differences are more likely than uniformity. A successful approach requires providing sufficient options to support variability among learners. While it is imperative for learners to develop coping strategies, the design of the learning environment should not require learners to cope with inequitable conditions.\nHow might we design learning environments that support and extend emotional capacity while honoring variability among learners?\nEmotional Capacity | Considerations\nConsideration 9.1Recognize expectations, beliefs, and motivations\nSet goals that inspire confidence and ownership of learning.\nConsideration 9.2Develop awareness of self and others\nDevelop and manage healthy emotional responses and interactions.\nConsideration 9.3Promote individual and collective reflection\nIncrease awareness around progress toward goals and how to learn from mistakes.\nConsideration 9.4Cultivate empathy and restorative practices\nLearn from others’ perspectives and repair harm.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "guideline_number": "9.1",
    "guideline_name": "Recognize expectations, beliefs, and motivations",
    "sub_guideline": "Emotional Capacity"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/emotional-capacity/expectations-beliefs-motivations/",
    "title": "Search",
    "content": "Engagement\nEmotional Capacity\nRecognize expectations, beliefs, and motivations\nOne important aspect of growing emotional capacity is the personal knowledge each learner has about what they find motivating, be it intrinsic or extrinsic. To accomplish this, learners can set personal goals that can be realistically reached, as well as foster positive beliefs that their goals can be met. However, learners also need to be supported to deal with frustration and anxiety when they are in the process of meeting their goals. Multiple options can be embedded into the learning environment to support learners to find inspiration in the learning process and to develop confidence in themselves as learners.\nUse prompts, reminders, guides, rubrics, and checklists that focus on:Setting regulatory goals like managing anxiety in response to challengeIncreasing the length of on-task orientation in the face of distractionsElevating the frequency of self-reflection\nUse prompts, reminders, guides, rubrics, and checklists that focus on:\nSetting regulatory goals like managing anxiety in response to challenge\nIncreasing the length of on-task orientation in the face of distractions\nElevating the frequency of self-reflection\nProvide coaches, mentors, or agents that model the process of setting personally appropriate goals that take into account both strengths and weaknesses.\nProvide coaches, mentors, or agents that model the process of setting personally appropriate goals that take into account both strengths and weaknesses.\nSupport activities that encourage self-reflection and appreciation of one’s strengths in order to build confidence.\nSupport activities that encourage self-reflection and appreciation of one’s strengths in order to build confidence.\nExamine the explicit and implicit expectations set by the environment and consider how bias may create barriers, such as low expectations or expecting every learner to demonstrate engagement in the same way.\nExamine the explicit and implicit expectations set by the environment and consider how bias may create barriers, such as low expectations or expecting every learner to demonstrate engagement in the same way.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Emotional Capacity",
    "guideline_number": "9.1",
    "guideline_name": "Recognize expectations, beliefs, and motivations"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/emotional-capacity/awareness/",
    "title": "Search",
    "content": "Engagement\nEmotional Capacity\nDevelop awareness of self and others\nProviding a model of regulatory skills and practices is not sufficient for most learners. Opportunities for learners to process their emotions and reflect on their strengths and challenges are essential. Reminders, models, and checklists can assist learners in choosing and trying an adaptive strategy for managing and directing their emotional responses to external events (e.g., strategies for coping with anxiety-producing social settings or for reducing task-irrelevant distractors) or internal events (e.g., strategies for decreasing rumination on depressive or anxiety-producing ideation). In addition, scaffolds may be provided to develop and support social awareness, or the ability to understand the perspectives of others, including people from different backgrounds and cultures. Such scaffolds should provide sufficient options to honor the variability and cultivate identity-safe spaces for every learner.\nUse differentiated models, scaffolds, and feedback for:Managing frustrationSeeking external emotional supportDeveloping internal controls and coping skillsAppropriately handling subject-specific phobias and judgments of “natural” aptitude (e.g., “How can I improve on the areas I am struggling in?” rather than “I am not good at math.”)\nUse differentiated models, scaffolds, and feedback for:\nManaging frustration\nSeeking external emotional support\nDeveloping internal controls and coping skills\nAppropriately handling subject-specific phobias and judgments of “natural” aptitude (e.g., “How can I improve on the areas I am struggling in?” rather than “I am not good at math.”)\nUse real life situations or simulations to demonstrate coping skills.\nUse real life situations or simulations to demonstrate coping skills.\nCreate opportunities for learners to reflect on social interactions.\nCreate opportunities for learners to reflect on social interactions.\nCreate opportunities for learners to appreciate their personal, cultural, and linguistic assets and the assets of others (e.g., displaying learner-created self-portraits, creating spaces for affinity groups, sharing notes of appreciation with peers and colleagues).\nCreate opportunities for learners to appreciate their personal, cultural, and linguistic assets and the assets of others (e.g., displaying learner-created self-portraits, creating spaces for affinity groups, sharing notes of appreciation with peers and colleagues).",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Emotional Capacity",
    "guideline_number": "9.2",
    "guideline_name": "Develop awareness of self and others"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/emotional-capacity/reflection/",
    "title": "Search",
    "content": "Engagement\nEmotional Capacity\nPromote individual and collective reflection\nCreating opportunities for individual and collective reflection is a key way to develop emotional capacity. A UDL lens reminds us of the remarkable variability of learners when it comes to metacognition. Some learners will have a heightened awareness of their progress toward goals and how to learn from mistakes along the way, while other learners can benefit from more explicit instruction and modeling. For many learners, merely recognizing they are making progress toward a goal is highly motivating. Alternatively, one of the key factors in losing motivation is when learners aren’t supported to recognize individual or collective progress. It is important that learners have multiple models and scaffolds of different self- and group-assessment techniques so they can identify and choose ones that are optimal.\nUse devices, aids, or charts to assist individuals and groups in learning to collect, chart, and display data from their own progress for the purpose of reflection and monitoring progress.\nUse activities that include a means by which learners get feedback and have access to alternative scaffolds (e.g., charts, templates, feedback displays) that support understanding progress in a manner that is understandable and timely.\nAdopt protocols that promote individual and collective reflection.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Emotional Capacity",
    "guideline_number": "9.3",
    "guideline_name": "Promote individual and collective reflection"
  },
  {
    "url": "https://udlguidelines.cast.org/engagement/emotional-capacity/empathy-restorative-practices/",
    "title": "Search",
    "content": "Engagement\nEmotional Capacity\nCultivate empathy and restorative practices\nEmpathy is an essential component for co-designing equitable learning environments. Human beings naturally feel a sense of empathy toward others with whom they identify or have a common experience. Additional care and awareness are required to cultivate a sense of empathy with those who may appear different or come from different backgrounds. Activities that invite listening to and considering perspectives other than one’s own, building communication skills, and offering content that authentically represents a diversity of lived experiences can help expand learners’ empathy for one another.\nEmpathy has the potential to build and sustain a caring learning community. This attention to others’ experiences and perspectives strengthens the communal bonds within a learning environment, creating a space in which learners feel safe taking risks and collaborative learning can take place.\nSometimes, trust is broken when care is not extended toward others. This may not be intentional, as sometimes we are not aware of how our actions impact others. While it can be challenging for some to confront these situations, restorative practices are a powerful vehicle for repair. Rather than punishing learners for mistakes, restorative practices allow for learners to consider the impact of their actions and design an appropriate response to repair trust in the community. Empathy is a key component to restorative practices, as learners practice identifying with the perspective of others, understand the difference between intent and impact, and seek to make the learning community whole.\nUse a strategy such as circle practice (a protocol where learners share about their emotions and experiences by passing a talking stick and responding one by one) or an emotions check-in to encourage learners to learn from one another’s perspectives.\nFacilitate learners sharing coping strategies or coping needs to encourage learners to take care of one another.\nInstitute protocols such as a “buddy bench” or an accountability partner to encourage communal responsibility for the learning community.\nCo-create and facilitate classroom agreements. Specifically ask learners to add to the agreements the things they need to feel safe in the classroom.\nCreate kind and equitable tools, processes, and protocols for learners to hold one another accountable to community agreements in classrooms, workplace settings, and other learning environments.\nUse a protocol such as circle practice to make communal decisions about how to restore the community after an agreement has been broken. These protocols can span primary through adult learner settings.",
    "source": "UDL Guidelines - CAST",
    "principle": "Engagement",
    "sub_guideline": "Emotional Capacity",
    "guideline_number": "9.4",
    "guideline_name": "Cultivate empathy and restorative practices"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/perception/",
    "title": "Search",
    "content": "Representation\nPerception\nLearning is impossible if information is imperceptible to the learner, difficult when information is presented in formats that require extraordinary effort or assistance, and oppressive when content reinforces stereotypes or deficit thinking. To reduce barriers to learning,it is important to ensure that key information is equally perceptible to all learners by: 1) offering the same information through different modalities(e.g., through vision, hearing, or touch);2) offering information in a format that will allow for adjustability by the user(e.g., text that can be enlarged, sounds that can be amplified); and3) offering a variety of perspectives(e.g., incorporating a range of authors and contributors; including authentic representations of people, cultures, histories, and identities).\nMultiple representations not only ensure that information is accessible to learners with particular sensory and perceptual disabilities, but also support access and comprehension for many others. In addition, providing learners with the opportunity to see themselves represented in the curriculum (e.g., \"mirrors\") as well as experience the perspectives of others (e.g., \"windows\") allows for stronger, more authentic connections to learning and greater opportunities for meaning making.\nPrompt: How might we increase accessibility, flexibility, and diversity in the sharing of information?\nPerception | Considerations\nConsideration 1.1Support opportunities to customize the display of information\nUse accessible materials with settings that can be adjusted based on needs and preferences.\nConsideration 1.2Support multiple ways to perceive information\nShare information in more ways than images and text alone.\nConsideration 1.3Represent a diversity of perspectives and identities in authentic ways\nLearn from multiple and varying perspectives.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "guideline_number": "1.1",
    "guideline_name": "Support opportunities to customize the display of information",
    "sub_guideline": "Perception"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/perception/customize-display/",
    "title": "Search",
    "content": "Representation\nPerception\nSupport opportunities to customize the display of information\nIn print materials, the display of information is fixed and permanent. Digital materials allow the display of the same information to be flexible and customizable. For example, a call-out box of background information may be displayed in a different location, enlarged, emphasized by the use of color, or deleted entirely. Such flexibility provides options for increasing the perceptual clarity and salience of information for a diversity of learners and allowing for preference adjustments for others. While these customizations can be more difficult with print materials, these are features that can be available through digital materials. It is important to note that digital does not mean the content is accessible, as many digital materials are equally inaccessible because the accessibility features were not included during content development. Educators and learners should work together to attain the best match of features to learning needs.\nOffer information in accessible formats so the following perceptual features can be customized:\nFont, size of text, character and line spacing, character width, background color, and text colors\nSize of images, graphs, tables, and other visual content\nContrast between background and images\nColor used for information or emphasis\nVolume or rate of speech or sound\nSpeed or timing of video, animation, sound, simulations, etc.\nLayout of visual or other elements",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Perception",
    "guideline_number": "1.1",
    "guideline_name": "Support opportunities to customize the display of information"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/perception/ways-perceive-information/",
    "title": "Search",
    "content": "Representation\nPerception\nSupport multiple ways to perceive information\nImages, graphics, animations, videos, or text may seem to be the optimal way to present information, especially when the information is about the relationships between objects, actions, numbers, or events. But such visual representations are not equally accessible to all learners, especially learners with visual disabilities or those who are not familiar with the type of graphic being used. Visual information can be quite dense, particularly with visual art, which can have multiple complex meanings and interpretations depending on contextual factors and the viewer’s knowledge base. To ensure all learners have equal access to information, it is essential to provide non-visual alternatives.\nProvide descriptions (text or spoken) for all images, graphics, videos, or animations.\nUse touch equivalents (tactile graphics or objects of reference) for key visuals that represent concepts.\nProvide physical objects and spatial models to convey perspective or interaction.\nProvide auditory cues for key concepts and transitions in visual information.\nTextis a special case of visual information. The transformation from text into audio is among the most easily accomplished methods for increasing accessibility. The advantage of text over audio is its permanence. At the same time, providing text that is easily transformable into audio accomplishes that permanence without sacrificing the advantages of audio. Digital synthetic text-to-speech is increasingly effective, but still disappoints in its ability to carry the valuable information in prosody.\nFollow accessibility standards (NIMASexternal site,DAISYexternal site, etc.) when creating digital text.\nAllow for a competent aide, partner, or “intervener” to read text aloud.\nProvide access to text-to-speech software.\nSoundis a particularly effective way to convey the impact of information, which is why sound design is so important in movies and why the human voice is particularly effective for conveying emotion and significance. However, information conveyed solely through sound is not equally accessible to all learners and is especially inaccessible for learners with hearing disabilities or for learners who have memory difficulties. Consider how frequently directions are only given orally. For learners who need more time to process information, this single mode of sharing information presents a barrier. In addition, listening itself is a complex strategic skill that must be learned. To ensure all learners have access to learning, options should be available for any information, including emphasis, presented aurally.\nUse text equivalents in the form of captions or automated speech-to-text (voice recognition) for spoken language.\nProvide visual diagrams, charts, or notations of music or sound.\nProvide written transcripts for videos or auditory clips.\nProvide sign languages for spoken communication.\nUse visual analogues to represent emphasis and prosody (e.g., emoticons, symbols, or images).\nProvide visual or tactile (e.g., vibrations) equivalents for sound effects or alerts.\nProvide visual and/or emotional description for musical interpretation.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Perception",
    "guideline_number": "1.2",
    "guideline_name": "Support multiple ways to perceive information"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/perception/perspectives-identities/",
    "title": "Search",
    "content": "Representation\nPerception\nRepresent a diversity of perspectives and identities in authentic ways\nIn addition to sensory perception, it is important for learners to perceive themselves and the perspectives of others in the curriculum, instructional materials, and media used in the learning environment. When learners are able to identify with perspectives and cultures portrayed in learning materials, it fosters a sense of validation, affirmation, and belonging. When learners never experience materials or references to which they can relate, they may feel a sense of subordination, as if their perspectives are less valid and appreciated within the learning environment. It is also important for learners to be exposed to the perspectives, identities, cultures, histories, and world views of others. Without exposure to other perspectives, learners may gain the false understanding that their lived experiences are universal for everyone or that others’ perspectives are less valid or valued.\nIncorporate a range of authors with various identities, including (but not limited to) gender, race, different abilities, nationality, and socio-economic background.\nRecognize the range of people, cultures, and histories that contribute to current understanding.\nAttend to the ways in which people and cultures are being portrayed.\nChallenge stereotypical or harmful portrayals of people and cultures.\nSeek authentic, complex portrayals of people, cultures, histories, and world views.\nFacilitate listening to diverse perspectives.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Perception",
    "guideline_number": "1.3",
    "guideline_name": "Represent a diversity of perspectives and identities in authentic ways"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/language-symbols/",
    "title": "Search",
    "content": "Representation\nLanguage & Symbols\nLearners vary in their facility with different forms of representation—both linguistic and non-linguistic. Vocabulary that may sharpen and clarify concepts for one learner may be difficult to understand for another. An equals sign (=) might help some learners understand that the two sides of the equation need to be balanced, but might cause confusion to a student who does not understand what it means. A graph that illustrates the relationship between two variables may be informative to one learner and inaccessible or puzzling to another. A picture or image that carries meaning for some learners may carry very different meanings for learners from differing cultural or familial backgrounds. As a result,inequalities arise when information is presented to all learners through a single form of representation.An important instructional strategy is toensure that multiple representations are available not only for accessibility, but for clarity, comprehensibility, and creating a shared understanding for all learners.\nPrompt: How might we offer, honor, and value multiple representations of language and symbols?\nLanguage & Symbols | Considerations\nConsideration 2.1Clarify vocabulary, symbols, and language structures\nConstruct meaning from words, symbols, and numbers using different representations.\nConsideration 2.2Support decoding of text, mathematical notation, and symbols\nMake sure text and symbols don't get in the way of the learning goal.\nConsideration 2.3Cultivate understanding and respect across languages and dialects\nUse translations, descriptions, movement, and images to support learning in unfamiliar or complex languages.\nConsideration 2.4Address biases in the use of language and symbols\nHonor a wide variety of forms of language.\nConsideration 2.5Illustrate through multiple media\nMake learning come alive with simulations, graphics, activities, and videos.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "guideline_number": "2.1",
    "guideline_name": "Clarify vocabulary, symbols, and language structures",
    "sub_guideline": "Language & Symbols"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/language-symbols/vocabulary-symbols-structure/",
    "title": "Search",
    "content": "Representation\nLanguage & Symbols\nClarify vocabulary, symbols, and language structures\nThe semantic elements through which information is presented—the words, symbols, numbers, icons, and language structures—are differentially accessible to learners with varying backgrounds, languages, and lexical knowledge. To ensure accessibility for all, key vocabulary, labels, icons, and symbols should be linked to, or associated with, alternate representations of their meaning (e.g., an embedded glossary or definition, a graphic equivalent, a chart or map). Idioms, archaic expressions, culturally exclusive phrases, and slang should be translated. When the syntax of a sentence or the structure of an equation or graphical representation is not obvious or familiar to learners, comprehension suffers. To ensure all learners have equal access to information, provide alternative representations that clarify, or make more explicit, the syntactic or structural relationships between elements of meaning.\nPre-teach vocabulary and symbols, especially in ways that promote connection to the learners’ experience and prior knowledge.\nPre-teach vocabulary and symbols, especially in ways that promote connection to the learners’ experience and prior knowledge.\nOffer graphic symbols with alternative text descriptions.\nOffer graphic symbols with alternative text descriptions.\nHighlight how complex terms, expressions, or equations are composed of simpler words or symbols.\nHighlight how complex terms, expressions, or equations are composed of simpler words or symbols.\nEmbed support for vocabulary and symbols within the text (e.g., hyperlinks or footnotes to definitions, explanations, illustrations, previous coverage, or translations).\nEmbed support for vocabulary and symbols within the text (e.g., hyperlinks or footnotes to definitions, explanations, illustrations, previous coverage, or translations).\nEmbed support for unfamiliar references within the text (e.g., domain-specific notation, lesser known properties and theorems, idioms, academic language, figurative language, mathematical language, jargon, archaic language, colloquialism, and dialect).\nEmbed support for unfamiliar references within the text (e.g., domain-specific notation, lesser known properties and theorems, idioms, academic language, figurative language, mathematical language, jargon, archaic language, colloquialism, and dialect).\nClarify unfamiliar syntax (in language or in math formulas) or underlying structure (in diagrams, graphs, illustrations, extended expositions, or narratives) through alternatives that:Highlight structural relations or make them more explicit.Make connections to previously learned structures.Make relationships between elements explicit (e.g., highlighting the transition words in an essay, linking between ideas in a concept map, etc.).\nClarify unfamiliar syntax (in language or in math formulas) or underlying structure (in diagrams, graphs, illustrations, extended expositions, or narratives) through alternatives that:\nHighlight structural relations or make them more explicit.\nMake connections to previously learned structures.\nMake relationships between elements explicit (e.g., highlighting the transition words in an essay, linking between ideas in a concept map, etc.).",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Language & Symbols",
    "guideline_number": "2.1",
    "guideline_name": "Clarify vocabulary, symbols, and language structures"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/language-symbols/text-notation-symbols/",
    "title": "Search",
    "content": "Representation\nLanguage & Symbols\nSupport decoding of text, mathematical notation, and symbols\nThe ability to fluently decode words, numbers, or symbols that have been presented in an encoded format (e.g., visual symbols for text, haptic symbols for Braille, algebraic expressions for relationships) takes practice for any learner, but some learners will reach automaticity more quickly than others. Learners need consistent and meaningful exposure to symbols to comprehend and use them effectively. Lack of fluency or automaticity greatly increases the cognitive load of decoding, thereby reducing the capacity for information processing and comprehension. To ensure all learners have equal access to knowledge, especially when the ability to decode is not the focus of instruction, it is important to offer options that reduce the barriers that decoding raises for learners who are unfamiliar with the symbols.\nAllow the use of text-to-speech.\nUse automatic voicing with digital mathematical notation (e.g., MathML).\nUse digital text with an accompanying human voice recording (e.g., DAISY Talking Books).\nAllow for flexibility and easy access to multiple representations of notation where appropriate (e.g., formulas, word problems, graphs).\nOffer clarification of notation through lists of key terms.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Language & Symbols",
    "guideline_number": "2.2",
    "guideline_name": "Support decoding of text, mathematical notation, and symbols"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/language-symbols/languages-dialects/",
    "title": "Search",
    "content": "Representation\nLanguage & Symbols\nCultivate understanding and respect across languages and dialects\nThe language of curricular materials is usually monolingual, but often the learners in the classroom are not. As such, the promotion of cross-linguistic understanding is especially important. For new learners of the dominant language (e.g., English in U.S. schools) or for learners of academic language (the dominant discourse in school), the accessibility of information is greatly reduced when no linguistic options are available. Offering multiple representations, especially for key information or vocabulary, is an important aspect of accessibility. In addition, while one particular language might be dominant, cultivating respect across languages and dialects requires recognizing that other languages and linguistic representations are valid and valued.\nOffer a diverse curriculum with a variety of literary works, historical perspectives, and cultural practices from various linguistic backgrounds.\nPromote the opportunity to share cultures and backgrounds.\nCelebrate linguistic diversity to showcase languages and cultures, fostering pride and respect among peers.\nMake all key information in the dominant language also available in home or heritage languages.\nLink key vocabulary words to definitions and pronunciations in both dominant and heritage languages.\nDefine domain-specific vocabulary (e.g., “map key” in social studies) using both domain-specific and common terms.\nIncorporate electronic translation tools or links to multilingual glossaries on the web.\nEmbed visual, non-linguistic supports for vocabulary clarification (e.g., pictures, videos, etc.).\nSupport translanguaging, the ability to move fluidly between languages, as an approach that encourages learners to use their full linguistic capital.\nRecognize and incorporate non-oral languages, such as sign languages.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Language & Symbols",
    "guideline_number": "2.3",
    "guideline_name": "Cultivate understanding and respect across languages and dialects"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/language-symbols/biases/",
    "title": "Search",
    "content": "Representation\nLanguage & Symbols\nAddress biases in the use of language and symbols\nAs countries and communities become increasingly diverse, it is common for environments to include learners who speak different languages and dialects. For example, people in the United States speak more than 350 languages, and the federal government does not designate any official language. Nevertheless, it is common for academic English to be perceived as the standard language for learning in schools or work environments. As a result, a hierarchy of language emerges with standard English at the top, and those who do not speak or understand this dominant language are often perceived as having a deficit or disadvantage. It is essential to disrupt any explicit or implicit messages of inferiority for those who use other languages or dialects (e.g., Spanish, Arabic, African American Vernacular English (AAVE), American Sign Language (ASL), etc.). Countries, communities, learning environments need to consider how different languages and dialects are perceived, portrayed, and treated in their contexts. This is especially imperative given that language is intimately interwoven with a person’s culture, values, and sense of identity. Offering content through the use of multiple languages and symbols creates more entry points for learners, increases accessibility, and provides linguistically diverse learners with a sense of value and belonging.\nFacilitate listening and understanding of diverse languages.\nUse closed captioning and sign languages when possible.\nUse closed captioning in more than one language.\nLabel classroom items in multiple languages.\nWelcome the use of multiple languages and dialects for communication, including speaking and writing.\nRecognize that the goal of learning standard languages is not assimilation or monolingualism.\nAvoid using ableist language (expressions that use terms associated with disabilities as pejoratives).\nAvoid using language and symbols associated with oppression, discrimination, or dehumanization.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Language & Symbols",
    "guideline_number": "2.4",
    "guideline_name": "Address biases in the use of language and symbols"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/language-symbols/multiple-media/",
    "title": "Search",
    "content": "Representation\nLanguage & Symbols\nIllustrate through multiple media\nClassroom materials are often dominated by information in text. But relying on text as a single mode of representation can impose barriers when presenting concepts and processes, particularly for learners who have text- or language-related disabilities or learners who communicate in languages other than the dominant language. Offering multiple representations—especially illustrations, simulations, images, videos, or interactive graphics—can make the information in text more relatable and comprehensible for any learner and accessible for some who would find it completely inaccessible in text.\nPresent key concepts beyond representation via text (e.g., an expository text or a math equation) with another or multiple formats (e.g., an illustration, dance/movement, diagram, table, model, video, comic strip, storyboard, photograph, animation, or physical or virtual manipulative).\nClarify links between information provided in texts and any accompanying representation of that information in illustrations, equations, charts, or diagrams.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Language & Symbols",
    "guideline_number": "5.1",
    "guideline_name": "Illustrate through multiple media"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/building-knowledge/",
    "title": "Search",
    "content": "Representation\nBuilding Knowledge\nEducation helps learners transform accessible information into usable knowledge and generate new understandings. Decades of cognitive science research have demonstrated that the capability to make meaning — transform accessible information into usable knowledge — is not a passive process, but an active one.Building usable knowledge, knowledge that is accessible for future decision-making, depends not upon merely perceiving information, but upon active skillslike making connections, synthesizing information, asking questions, selective attending, integrating new information with prior knowledge, strategic categorization, and active memorization. Constructing usable knowledge could involve collaborative knowledge building, a process essential to making information meaningful for learners. It involves learners working together, whether they are adults or children, to co-construct knowledge. This collaboration leverages diverse perspectives and experiences, enhancing the depth and breadth of understanding. Through dialogue and shared activities, learners can challenge and refine their ideas, leading to more robust and adaptable knowledge. Research has shown that collaborative environments where students engage in shared inquiry and problem-solving foster deeper understanding and collective knowledge advancement. Individuals differ greatly in their prior knowledge, familiarity with various ways of knowing, and approaches to building knowledge.Intentional design and multiple representations of information— the responsibility of any curriculum or instructional methodology —can offer the options and scaffolds necessary to ensure all learners have access to knowledge.\nPrompt: How might we incorporate multiple ways for building individual and collective knowledge?\nBuilding Knowledge | Considerations\nConsideration 3.1Connect prior knowledge to new learning\nBuild connections to prior understandings and experiences.\nConsideration 3.2Highlight and explore patterns, critical features, big ideas, and relationships\nAccentuate important information and how it relates to the learning goal.\nConsideration 3.3Cultivate multiple ways of knowing and making meaning\nHonor multiple and diverse ways of developing understandings of the world.\nConsideration 3.4Maximize transfer and generalization\nApply learning to new contexts.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "guideline_number": "3.1",
    "guideline_name": "Connect prior knowledge to new learning",
    "sub_guideline": "Building Knowledge"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/building-knowledge/prior-knowledge/",
    "title": "Search",
    "content": "Representation\nBuilding Knowledge\nConnect prior knowledge to new learning\nInformation is more accessible and likely to be understood by learners when it is presented in a way that primes, activates, or provides any prerequisite knowledge. Barriers and inequities exist when background knowledge that is unfamiliar to some learners is critical to integrating or using new information. However, there are also barriers for learners who have the necessary background knowledge, but might not know it is relevant. Those barriers can be reduced when options are available that support learners in connecting relevant prior knowledge, or link to the prerequisite information elsewhere.\nAnchor instruction by linking to and activating relevant prior knowledge (e.g., using visual imagery, concept anchoring, or concept mastery routines).\nUse advanced organizers (e.g., KWL methods, concept maps).\nPre-teach critical prerequisite concepts through demonstration or models.\nBridge concepts with relevant analogies and metaphors.\nMake explicit cross-curricular connections (e.g., teaching literacy strategies in the social studies classroom).",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Building Knowledge",
    "guideline_number": "3.1",
    "guideline_name": "Connect prior knowledge to new learning"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/building-knowledge/patterns-features/",
    "title": "Search",
    "content": "Representation\nBuilding Knowledge\nHighlight and explore patterns, critical features, big ideas, and relationships\nOne of the big differences between experts and novices in any domain is the facility with which they distinguish what is critical from what is unimportant or irrelevant. As learners deepen their understanding, they increase their ability to distinguish what is critical and how it relates to the learning goal. They recognize the most important features in information and allocate their time efficiently, identifying what is valuable and finding the right “hooks” with which to integrate the most valuable information into existing knowledge. As a result, one of the most effective ways to make information more accessible is to use explicit cues or prompts that assist learners in attending to those features that matter most while avoiding those that matter least.\nHighlight or emphasize key elements in text, graphics, diagrams, or formulas.\nUse outlines, graphic organizers, unit organizer routines, concept organizer routines, and concept mastery routines to emphasize key ideas and relationships.\nUse multiple examples and non-examples to emphasize critical features.\nUse cues and prompts to draw attention to critical features.\nHighlight previously learned skills that can be used to solve unfamiliar problems.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Building Knowledge",
    "guideline_number": "3.2",
    "guideline_name": "Highlight and explore patterns, critical features, big ideas, and relationships"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/building-knowledge/making-meaning/",
    "title": "Search",
    "content": "Representation\nBuilding Knowledge\nCultivate multiple ways of knowing and making meaning\nEquitable learning environments guide learners in the process of constructing knowledge by valuing and cultivating multiple ways of knowing and making meaning. Diverse cultural perspectives bring unique insights and methods of understanding the world. Indigenous knowledge systems, for instance, emphasize holistic and interconnected ways of knowing, which can complement and enrich Western methodologies. By incorporating and respecting these various approaches, education can become more inclusive and effective. This broad approach helps in creating a more inclusive educational environment that respects and utilizes the diverse backgrounds of every learner. Well-designed learning materials and environments incorporate multiple approaches to building knowledge, including but not limited to problem solving, storytelling, algorithms, and holistic and linear thinking. Incorporating multiple ways for meaning making, along with embedding models, scaffolds, and feedback, can assist learners in knowing how to apply different approaches and use those strategies effectively.\nIncorporate multiple ways of knowing, including storytelling, kinesthetics, problem solving, and relational learning through interpersonal experiences.\nUse explicit prompts for each step in a sequential process to help learners develop a logical flow specific for their understanding and create a structure of complex tasks.\nUse options for organizational methods and approaches (e.g., tables and algorithms for processing mathematical operations), supporting the various cognitive approaches and enhancing comprehension .\nUse interactive models that guide exploration and new understandings.\nIntroduce graduated scaffolds that support information processing strategies.\nProvide multiple entry points to a lesson and optional pathways through content (e.g., exploring big ideas through dramatic works, arts and literature, film, and media).\n“Chunk” information into smaller elements, helping to prevent cognitive overload.\nProgressively release information (e.g., sequential highlighting).\nRemove unnecessary distractions unless they are essential to the instructional goal.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Building Knowledge",
    "guideline_number": "3.3",
    "guideline_name": "Cultivate multiple ways of knowing and making meaning"
  },
  {
    "url": "https://udlguidelines.cast.org/representation/building-knowledge/transfer-generalization/",
    "title": "Search",
    "content": "Representation\nBuilding Knowledge\nMaximize transfer and generalization\nAll learners need to be able to generalize and transfer their learning to new contexts. Learners vary in the amount of scaffolding they need for memory and transfer in order to improve their ability to access their prior learning. Of course, all learners can benefit from assistance in how to transfer the information they have to other situations, as learning is not about individual facts in isolation. Learners need multiple representations for this to occur. Without this support and the use of multiple representations, information might be learned, but is inaccessible in new situations. Supports for memory, generalization, and transfer include techniques that are designed to heighten the memorability of the information, as well as those that prompt and guide learners to employ explicit strategies.\nUse checklists, organizers, sticky notes, and electronic reminders.\nPrompt the use of mnemonic strategies and devices (e.g., visual imagery, paraphrasing strategies, method of loci, etc.).\nIncorporate explicit opportunities for the review and practice of new concepts or skills, including social skills.\nUse templates, graphic organizers, and concept maps to support note-taking.\nUse scaffolds that connect new information to prior knowledge (e.g., word webs, half-full concept maps).\nEmbed new ideas in familiar ideas and contexts (e.g., use of analogy, metaphor, drama, music, film, etc.) to make learning more relatable.\nIncorporate explicit, supported opportunities to generalize learning to new situations (e.g., different types of problems that can be solved with linear equations, using physics principles to build a playground).\nOffer opportunities over time to revisit key ideas and linkages between ideas.",
    "source": "UDL Guidelines - CAST",
    "principle": "Representation",
    "sub_guideline": "Building Knowledge",
    "guideline_number": "3.4",
    "guideline_name": "Maximize transfer and generalization"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/interaction/",
    "title": "Search",
    "content": "Action & Expression\nInteraction\nA textbook or workbook in print format provides limited means of navigation or physical interaction (e.g., turning pages, handwriting in spaces provided). Many interactive pieces of educational software similarly provide only limited means of navigation or interaction (e.g., using a mouse or keyboard). More broadly, the physical design of the learning space can also be restrictive (e.g. narrow aisles, inflexible seating and table arrangements, inflexible height of a whiteboard, etc.). Navigation and interaction in those limited ways will raise barriers for some learners—for example, learners with physical disabilities, blindness, dysgraphia, or those who need various executive functioning supports.It is important to design materials and physical environments that support and value the interaction needs and preferences of every learner. Intentionally designed curricular materials provide a seamless interface with common assistive and accessible technologiesthrough which everyone, including individuals with disabilities, can navigate and express what they know. These tools allow navigation or interaction with a single switch, through voice-activated switches, expanded keyboards, and others. And intentionally designed physical learning environments provide the options and flexibility in the physical environment to support the interaction and navigation necessary to engage in the learning process.\nPrompt: How might we design materials and physical environments that ensure access and participation for every learner?\nInteraction | Considerations\nConsideration 4.1Vary and honor the methods for response, navigation, and movement\nInteract with tools and environments that make learning physically accessible.\nConsideration 4.2Optimize access to accessible materials and assistive and accessible technologies and tools\nOpen doors to learning with accessible tools and devices.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "guideline_number": "4.1",
    "guideline_name": "Vary and honor the methods for response, navigation, and movement",
    "sub_guideline": "Interaction"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/interaction/response-navigation-movement/",
    "title": "Search",
    "content": "Action & Expression\nInteraction\nVary and honor the methods for response, navigation, and movement\nLearners differ widely in the ways they navigate and move through the physical environment, information, and activities. To reduce barriers to learning, it is essential to embed flexibility in the means for response, navigation, and movement. And along with this flexibility comes the need to reflect on biases and assumptions regarding these different means; it is important to honor the multiplicity of ways to engage and embody the learning process.\nEmbed flexibility in the requirements for rate, timing, speed, and range of motor action required to interact with instructional materials, physical manipulatives, and technologies.\nOffer options for physically responding or indicating selections (e.g., alternatives to marking with pen and pencil, alternatives to mouse control).\nOffer options for physically interacting with materials by hand, voice, single switch, joystick, keyboard, or adapted keyboard.\nEmbed flexibility into the design of the physical space (e.g., flexible seating and positioning, lighting, etc.)",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Interaction",
    "guideline_number": "4.1",
    "guideline_name": "Vary and honor the methods for response, navigation, and movement"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/interaction/assistive-technologies/",
    "title": "Search",
    "content": "Action & Expression\nInteraction\nOptimize access to accessible materials and assistive and accessible technologies and tools\nThe use of accessible materials and assistive and accessible technologies and tools strengthens opportunities for every learner to experience access, participation, and progress in the learning process. Increasingly accessible technologies are built into the devices many learners already own and use. Similarly, it has become more common for authoring tools to include options for creating accessible content at the point of need, rather than by acquiring them from a publisher or other external source.\nProviding a learner with a tool is often not enough. We need to provide the support to use the tool effectively. Oftentimes, learners may need assistance in navigating through their environment (both in terms of physical space and the curriculum), and every learner should be given the opportunity to use tools that might help them meet the goal of full access and participation in the learning environment. However, significant numbers of learners with disabilities use assistive technologies for navigation, interaction, and composition on a regular basis. It is critical that instructional technologies and curricula are accessible and do not impose inadvertent barriers to the use of these assistive technologies. It is also important, however, to ensure that making a lesson physically accessible does not inadvertently reduce the challenge associated with the learning goal.\nEnsure navigation and interaction can be performed with a variety of tools, including keyboard, mouse, switch devices, and voice commands.\nOffer the ability to leverage alternate keyboard commands for mouse action.\nUse access to alternative keyboards (e.g., on-screen keyboards for touchscreens).\nCustomize overlays for touch screens and keyboards.\nSelect software that works seamlessly with keyboard alternatives.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Interaction",
    "guideline_number": "4.2",
    "guideline_name": "Optimize access to accessible materials and assistive and accessible technologies and tools"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/expression-communication/",
    "title": "Search",
    "content": "Action & Expression\nExpression & Communication\nThere is no medium of expression that is equally suited for all learners or for all kinds of communication. On the contrary, there are media that seem poorly suited for some kinds of expression and for some kinds of learning.It is important to provide multiple modalities for expression to reduce communication barriers and support learners to express knowledge, ideas, and concepts in the learning environment.\nPrompt: How might we design learning environments that value multiple and novel modes of expression and communication, including those that have been historically deprioritized?\nExpression & Communication | Considerations\nConsideration 5.1Use multiple media for communication\nExpress learning in flexible ways.\nConsideration 5.2Use multiple tools for construction, composition, and creativity\nShare thoughts and ideas using tools that complement the learning goal.\nConsideration 5.3Build fluencies with graduated support for practice and performance\nApply and gradually release scaffolds to support learner agency.\nConsideration 5.4Address biases related to modes of expression and communication\nHonor a wide variety of forms of communication.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "guideline_number": "5.1",
    "guideline_name": "Use multiple media for communication",
    "sub_guideline": "Expression & Communication"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/expression-communication/multiple-media/",
    "title": "Search",
    "content": "Action & Expression\nExpression & Communication\nUse multiple media for communication\nUnless specific media and materials are critical to the goal (e.g., learning to paint specifically with oils, learning to hand write with calligraphy), it is important to welcome and encourage a variety of media for expression. Such variety reduces media-specific barriers to communication among learners with disabilities, honors forms of communication that have historically been devalued, and increases the opportunities for every learner to develop a wider range of expression in a media-rich world. For example, it is important for all learners to learncomposition, not just writing, and to learn the optimal medium for any particular content of expression and audience.\nCompose in multiple media such as text, speech, drawing, illustration, comics, storyboards, design, film, music, storytelling, dance/movement, visual art, sculpture, or video.\nUse physical manipulatives (e.g., building blocks, 3D models, base-10 blocks).\nUse social media and interactive web tools (e.g., discussion forums, chats, web design, annotation tools, storyboards, comic strips, animation presentations).\nSolve problems using a variety of strategies.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Expression & Communication",
    "guideline_number": "5.1",
    "guideline_name": "Use multiple media for communication"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/expression-communication/construction-composition-creativity/",
    "title": "Search",
    "content": "Action & Expression\nExpression & Communication\nUse multiple tools for construction, composition, and creativity\nMany schools/learning environments tend to focus on traditional tools to the exclusion of contemporary ones. Without being prompted to consider contemporary tools, educators and instructional designers often depend on the tools they’ve grown accustomed to. It is imperative to update tools to align with current contexts and innovations.\nFor example, generative artificial intelligence (AI) has become a necessary consideration when designing learning experiences around composition. Relying upon traditional tools has several liabilities: 1) it does not prepare learners for their future; 2) it limits the range of content and teaching methods that can be implemented; 3) it restricts learners’ ability to express knowledge about content; and, most importantly, 4) it restricts the kinds of learners who can be successful.\nCurrent media tools provide a more flexible, creative, and accessible toolkit with which learners can more successfully take part in their learning and articulate what they know. Unless a goal is focused on learning to use a specific tool (e.g., learning to draw with a compass, learning a specific programming software), learning environments should embed a range of options for construction, composition, and creativity. In an environment where there is access to a variety of tools, learners can explore and learn to use tools that are an optimal match between their preferences and the goals of the task.\nUse spell checkers, grammar checkers, word-prediction software.\nUse speech-to-text software (voice recognition), human dictation, recording.\nUse calculators, graphing calculators, geometric sketch pads, or pre-formatted graph paper.\nUse sentence starters or sentence strips.\nUse story webs, outlining tools, or concept mapping tools.\nUse Computer-Aided-Design (CAD), music notation (writing) software, or mathematical notation software.\nUse virtual or concrete mathematics manipulatives (e.g., base-10 blocks, algebra blocks).\nUse web applications (e.g., collaborative applications, animation, presentation).",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Expression & Communication",
    "guideline_number": "5.2",
    "guideline_name": "Use multiple tools for construction, composition, and creativity"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/expression-communication/fluencies-practice-performance/",
    "title": "Search",
    "content": "Action & Expression\nExpression & Communication\nBuild fluencies with graduated support for practice and performance\nAs learners work to develop a variety of fluencies (e.g., visual, audio, mathematical, reading, etc.), multiple scaffolds can assist them as they explore, experiment, practice, and develop confidence. This experience of engaging in exploration, experimentation, and practice occurs when meaningful and authentic learning can take place. Instead of emphasizing the end product, the most valuable learning can take place during the process itself. Learning environments can support the development of fluencies by embedding a variety of formative assessment opportunities as well as scaffolds that can be gradually released over time. These formative assessments and scaffolds can offer flexibility in terms of scaffolds and supports depending on goals and contexts.\nWhile engaging in the process of learning itself is critical, the end product or performance can also be a meaningful way to build fluencies, be it in the form of an essay or a dramatic production or some other form of expression. Performance can offer learners the opportunity to synthesize their learning in personally relevant ways and share it with others. Overall, it is important to embed options that build learners’ fluencies for both practice and performance.\nUse differentiated models to emulate (e.g., models that demonstrate the same outcomes but use differing approaches, strategies, skills, etc.).\nUse differentiated mentors (e.g., teachers/tutors who use different approaches to motivate, guide, feedback, or inform).\nUse scaffolds that can be gradually released with increasing independence and skills (e.g., embedded into digital reading and writing software).\nUse differentiated feedback (e.g., feedback that is accessible because it can be customized to individual learners).\nUse multiple examples of novel solutions to authentic problems.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Expression & Communication",
    "guideline_number": "5.3",
    "guideline_name": "Build fluencies with graduated support for practice and performance"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/expression-communication/bias/",
    "title": "Search",
    "content": "Action & Expression\nExpression & Communication\nAddress biases related to modes of expression and communication\nToo often, individual and systemic biases devalue certain forms of expression and communication and prioritize others. For example, many schools and institutions of higher education consider text-based forms of communication as more rigorous than other forms of communication; storytelling is central to Indigenous communities as a way to pass on knowledge from one generation to the next, yet oral traditions have historically been silenced or ignored; and closed captioning is often prioritized over sign languages. Honoring and valuing multiple forms of expression and communication is critical to designing inclusive and equitable learning environments.\nAnticipate and explore how bias can influence the modes of expression and communication that are offered.\nAnticipate and explore how bias can influence the ways modes of expression and communication are selected.\nCommunicate in multiple ways how modes of expression that align with the goal are equally valued.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Expression & Communication",
    "guideline_number": "5.4",
    "guideline_name": "Address biases related to modes of expression and communication"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/strategy-development/",
    "title": "Search",
    "content": "Action & Expression\nStrategy Development\nA critical aspect of learning is the capacity to act skillfully and purposefully, or to demonstrate “executive functions.” One component of executive function as it relates to the strategic networks is strategy development. Strategic networks include the prefrontal cortex and are interconnected with networks that impact affect and recognition. These capabilities connected to the strategic networks allow humans to become intentional in their short-term reactions to their environment and to set long-term goals and plan effective strategies for reaching those goals. These practices include monitoring progress and modifying strategies as needed. In short, they support learners to use the resources and tools available to make the most out of learning.\nThe UDL framework typically involves efforts to expand executive capacity in two ways: 1) by scaffolding lower level skills so they require less executive processing; and 2) by scaffolding higher level executive skills and strategies so they are more effective and developed. Previous guidelines have addressed accessibility supports and scaffolding. This guideline addresses ways to provide scaffolding for executive functions themselves.\nStrategy Development | Considerations\nConsideration 6.1Set meaningful goals\nPractice setting challenging and authentic goals.\nConsideration 6.2Anticipate and plan for challenges\nFormulate reasonable plans for reaching goals.\nConsideration 6.3Organize information and resources\nSupport organization and memory using flexible tools and processes.\nConsideration 6.4Enhance capacity for monitoring progress\nAnalyze growth over time and how to build from it.\nConsideration 6.5Challenge exclusionary practices\nWork toward building more inclusive spaces and systems.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "guideline_number": "6.1",
    "guideline_name": "Set meaningful goals",
    "sub_guideline": "Strategy Development"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/strategy-development/goals/",
    "title": "Search",
    "content": "Action & Expression\nStrategy Development\nSet meaningful goals\nSetting meaningful goals that are both challenging and motivating is a critical part of the learning process. It is important to set goals that are big enough to capture the vision and complexity of what is being learned, but are specific enough to be clear, objective, and measurable. Articulating a goal helps to develop a plan to achieve it and to identify the tools or resources that will best support the learning along the way. Knowing the goal helps to monitor progress, recognize when to shift strategies or direction, and to give meaningful feedback.\nUse prompts and scaffolds to estimate effort, resources, and challenge.\nUse models or examples of the process and product of goal-setting.\nUse guides and checklists for scaffolding goal-setting.\nPost goals, objectives, and schedules in an obvious place.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Strategy Development",
    "guideline_number": "6.1",
    "guideline_name": "Set meaningful goals"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/strategy-development/challenges/",
    "title": "Search",
    "content": "Action & Expression\nStrategy Development\nAnticipate and plan for challenges\nOnce a goal is set, it is important to create time and space to plan a strategy, identify useful tools, and anticipate the challenges that may surface along the way. This proactive planning can reduce barriers and ensure more individuals have the opportunity to reach their goals.\nUse reflection prompts to anticipate challenges and encourage strategic planning.\nUse prompts to “show and explain your work” (e.g., portfolio review, art critiques).\nUse checklists and project planning templates for understanding the goal and setting up prioritization, sequences, and schedules of steps.\nUse coaches or mentors that model think-alouds of the process.\nUse guides for breaking long-term goals into reachable short-term objectives.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Strategy Development",
    "guideline_number": "6.2",
    "guideline_name": "Anticipate and plan for challenges"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/strategy-development/organize-information/",
    "title": "Search",
    "content": "Action & Expression\nStrategy Development\nOrganize information and resources\nWorking memory can be conceptualized as a “scratch pad” for maintaining chunks of information to access as part of building knowledge and problem-solving. Wherever working memory capacity is not construct-relevant, it is important to draw from a variety of scaffolds and organizational aids to keep information organized and “in mind.”\nUse graphic organizers and templates for data collection and organizing information.\nUse prompts for categorizing, systematizing, and discovering themes and patterns.\nUse checklists and guides for note-taking.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Strategy Development",
    "guideline_number": "6.3",
    "guideline_name": "Organize information and resources"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/strategy-development/monitoring-progress/",
    "title": "Search",
    "content": "Action & Expression\nStrategy Development\nEnhance capacity for monitoring progress\nLearning cannot happen without feedback, and that means learners need a clear understanding of the progress that is being made toward the learning goal. Generating multiple and varied forms of feedback throughout the learning process is essential to supporting learners’ growth. It is important to ensure these multiple and varied forms of feedback are explicitly connected to the learning goal and are explicit, timely, informative, accessible, and customizable. Especially important is providing “formative” feedback that supports learners to monitor their own progress effectively and to use that information to guide their own effort and practice.\nUse prompts to guide self-monitoring and reflection.\nUse representations of progress (e.g., before-and-after photos, graphs and charts showing progress over time, process portfolios).\nExplore the different types of feedback that are most useful according to specific preferences, goals, and contexts.\nUse templates that guide self-reflection on quality and completeness.\nUse differentiated models of self-assessment strategies (e.g., role-playing, video reviews, peer feedback).\nUse checklists, rubrics, models, and examples.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Strategy Development",
    "guideline_number": "6.4",
    "guideline_name": "Enhance capacity for monitoring progress"
  },
  {
    "url": "https://udlguidelines.cast.org/action-expression/strategy-development/exclusionary-practices/",
    "title": "Search",
    "content": "Action & Expression\nStrategy Development\nChallenge exclusionary practices\nDeep-seated biases and systems of discrimination have led to the exclusion of historically marginalized learners across societies and around the globe. It is imperative to create structures to learn from learners’ lived experiences in order to surface exclusionary practices–as well as to address them.\nCreate time for regular community sessions and individual reflection sessions.\nWork as individuals and as communities to name, explore, and address exclusionary practices.\nWork as individuals and as communities to develop concrete and specific actions for addressing exclusionary practices and building inclusive communities.\nWhen an exclusionary practice is uncovered, provide opportunities for healing using community-based practices such as restorative justice.",
    "source": "UDL Guidelines - CAST",
    "principle": "Action & Expression",
    "sub_guideline": "Strategy Development",
    "guideline_number": "6.5",
    "guideline_name": "Challenge exclusionary practices"
  }
]